БСП_ВА/src/InformationRegisters/МиграцияПриложенийСостояниеВыгрузки/МиграцияПриложенийСостояниеВыгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МиграцияПриложенийСостояниеВыгрузки</name>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>АдресПриложения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВыгружатьНастройкиПользователей</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ЗавершитьМиграциюАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УзелОбмена</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </resources>
  <resources>
    <name>НомерОтправленногоСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерПринятогоСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИзмененоОбъектов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыгруженоОбъектов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗагруженоОбъектов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПоследнийОбъектМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСостоянияЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнейВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияМиграцииПриложения</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеСвойства</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
</mdclass:InformationRegister>

БСП_ВА/src/Enums/СостоянияМиграцииПриложения/СостоянияМиграцииПриложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияМиграцииПриложения</name>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>ЗавершенаСОшибкой</name>
  </enumValues>
  <enumValues>
    <name>ЗавершенаУспешно</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеЗагрузки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОбновления</name>
  </enumValues>
</mdclass:Enum>

БСП_ВА/src/CommonModules/МиграцияПриложенийВызовСервера/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает признак необходимости открыть форму миграции приложения.
//
// Возвращаемое значение:
//   Булево - Истина если нужно открыть форму.
//
Функция НужноОткрытьФорму() Экспорт
	
	Если Не РаботаВМоделиСервиса.ДоступноИспользованиеРазделенныхДанных()
		Или Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Состояния = Новый Массив;
	Состояния.Добавить(Перечисления.СостоянияМиграцииПриложения.Выполняется);
	Состояния.Добавить(Перечисления.СостоянияМиграцииПриложения.ОжиданиеЗагрузки);
	Состояния.Добавить(Перечисления.СостоянияМиграцииПриложения.ЗавершенаУспешно);
	Состояния.Добавить(Перечисления.СостоянияМиграцииПриложения.ЗавершенаСОшибкой);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Инициатор", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("Состояния", Состояния);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИСТИНА КАК Проверка
	|ИЗ
	|	РегистрСведений.МиграцияПриложенийСостояниеВыгрузки КАК МиграцияПриложенийСостояниеВыгрузки
	|ГДЕ
	|	МиграцияПриложенийСостояниеВыгрузки.Инициатор = &Инициатор
	|	И МиграцияПриложенийСостояниеВыгрузки.Состояние В(&Состояния)";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти
